// 210601.cpp : 콘솔 응용 프로그램에 대한 진입점을 정의합니다.
//

#include "stdafx.h"


int main()
{
	// 객체 지향 프로그래밍 (OOP, Object Oriented Programming)
	// 객체에 중점을 둔 프로그래밍
	// 객체간의 의사소통으로 프로그래밍이 진행된다.
	
	// 객체란?
	// 실 세계를 구성하는 하나의 실체.
	// -> 사람, 칠판, 모니터 등등등

	// Message Passing
	// 프로그램을 구성하는 객체 간의 의사소통
	// 의사소통은 각 객체가 가지고 있는 함수들을 통해 이루어진다.

	// 객체 지향 프로그래밍의 장점
	// 실 세계를 프로그램에 그대로 반영할 수 있다.
	// 유지보수 및 관리가 용이하다.


	// 클래스란?
	// C++부터 등장한 사용자 정의 자료형이다.
	// 데이터(변수)와 데이터를 다루는 기능(함수)을 하나로 묶어 놓은 것이다.
	// 객체들을 추상화 시킨 하나의 틀이다.

	// 프로그래밍에서 객체란?
	// 클래스는 사용자 정의 자료형이다.
	// 자료형에 변수명을 부여하면 메모리에 등록이 된다.
	// 메모리에 등록된 클래스를 객체라한다.
	// 다른 말로 Instance라고도 부른다.

	// 추상화란?
	// 공통된 요소를 추출하는 작업


    return 0;
}

